stubs/providers/payment-options/success.json

{
  "code": 200,
  "status": "success",
  "message": "Request completed successfully.",
  "data": [
    {
      "id": "mtn_ug",
      "name": "MTN Mobile Money",
      "transaction_currency": "UGX",
      "min_amount": 3000,
      "max_amount": 5000000,
      "available": true
    },
    {
      "id": "airtel_ug",
      "name": "Airtel Money",
      "transaction_currency": "UGX",
      "min_amount": 3000,
      "max_amount": 5000000,
      "available": true
    }
  ]
}